---
kind: method
id: M:Autodesk.Revit.DB.TableCellStyle.SetCellStyleOverrideOptions(Autodesk.Revit.DB.TableCellStyleOverrideOptions)
source: html/b8c8d084-835b-9bd0-1181-1506915ad484.htm
---
# Autodesk.Revit.DB.TableCellStyle.SetCellStyleOverrideOptions Method

Sets cell style override options of this cell.

## Syntax (C#)
```csharp
public void SetCellStyleOverrideOptions(
	TableCellStyleOverrideOptions helper
)
```

## Parameters
- **helper** (`Autodesk.Revit.DB.TableCellStyleOverrideOptions`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null